{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[CHESS::]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[::GAME]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "BertNormalizer",
    "clean_text": true,
    "handle_chinese_chars": true,
    "strip_accents": null,
    "lowercase": false
  },
  "pre_tokenizer": {
    "type": "WhitespaceSplit"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "WordPiece",
    "unk_token": "[UNK]",
    "continuing_subword_prefix": "##",
    "max_input_chars_per_word": 100,
    "vocab": {
      "[CHESS::]": 0,
      "[::GAME]": 1,
      "[UNK]": 2,
      "<pad>": 3,
      "#": 4,
      "+": 5,
      "-": 6,
      "1": 7,
      "2": 8,
      "3": 9,
      "4": 10,
      "5": 11,
      "6": 12,
      "7": 13,
      "8": 14,
      ":": 15,
      ";": 16,
      "=": 17,
      "A": 18,
      "B": 19,
      "C": 20,
      "E": 21,
      "G": 22,
      "H": 23,
      "K": 24,
      "M": 25,
      "N": 26,
      "O": 27,
      "Q": 28,
      "R": 29,
      "S": 30,
      "W": 31,
      "[": 32,
      "]": 33,
      "a": 34,
      "b": 35,
      "c": 36,
      "d": 37,
      "e": 38,
      "f": 39,
      "g": 40,
      "h": 41,
      "i": 42,
      "m": 43,
      "n": 44,
      "r": 45,
      "s": 46,
      "t": 47,
      "w": 48,
      "x": 49,
      "y": 50,
      "##-": 51,
      "##B": 52,
      "##b": 53,
      "##8": 54,
      "##+": 55,
      "##R": 56,
      "##g": 57,
      "##1": 58,
      "##2": 59,
      "##c": 60,
      "##f": 61,
      "##6": 62,
      "##x": 63,
      "##a": 64,
      "##h": 65,
      "##e": 66,
      "##7": 67,
      "##Q": 68,
      "###": 69,
      "##N": 70,
      "##4": 71,
      "##5": 72,
      "##d": 73,
      "##3": 74,
      "##K": 75,
      "##=": 76,
      "##C": 77,
      "##H": 78,
      "##E": 79,
      "##S": 80,
      "##:": 81,
      "##]": 82,
      "##G": 83,
      "##A": 84,
      "##M": 85,
      "##O": 86,
      "##y": 87,
      "##i": 88,
      "##n": 89,
      "##s": 90,
      "##t": 91,
      "##r": 92,
      "##w": 93,
      "W-": 94,
      "B-": 95,
      "W-N": 96,
      "B-N": 97,
      "W-B": 98,
      "B-B": 99,
      "W-R": 100,
      "B-R": 101,
      "W-Q": 102,
      "B-Q": 103,
      "##xd": 104,
      "B-K": 105,
      "W-K": 106,
      "##xe": 107,
      "##xf": 108,
      "##xc": 109,
      "##::": 110,
      "W-e": 111,
      "##f3": 112,
      "##f6": 113,
      "B-e": 114,
      "W-d": 115,
      "##-O": 116,
      "B-d": 117,
      "##c6": 118,
      "##c3": 119,
      "##O-O": 120,
      "##g5": 121,
      "##g4": 122,
      "##b5": 123,
      "##c4": 124,
      "##c5": 125,
      "##b4": 126,
      "##xd4": 127,
      "##xd5": 128,
      "[C": 129,
      "[::": 130,
      "by": 131,
      "wi": 132,
      "##HE": 133,
      "##E]": 134,
      "##SS": 135,
      "##GA": 136,
      "##ME]": 137,
      "##ns": 138,
      "##::]": 139,
      "[CHE": 140,
      "[::GA": 141,
      "wins": 142,
      "##SS::]": 143,
      "##e7": 144,
      "W-Nf3": 145,
      "##f4": 146,
      "##g6": 147,
      "##d7": 148,
      "##xe5": 149,
      "##e2": 150,
      "##f5": 151,
      "##d2": 152,
      "B-Nf6": 153,
      "##g3": 154,
      "W-e4": 155,
      "##xa": 156,
      "B-a": 157,
      "##h6": 158,
      "##b3": 159,
      "##b6": 160,
      "W-d4": 161,
      "W-h": 162,
      "W-a": 163,
      "B-Nc6": 164,
      "W-Nc3": 165,
      "W-O-O": 166,
      "##xe4": 167,
      "##d3": 168,
      "##h5": 169,
      "##e3": 170,
      "B-O-O": 171,
      "##g7": 172,
      "B-e5": 173,
      "B-d5": 174,
      "re": 175,
      "##gn": 176,
      "##ign": 177,
      "##sign": 178,
      "resign": 179,
      "##e1": 180,
      "##d6": 181,
      "##e5": 182,
      "##e6": 183,
      "##e8": 184,
      "##e4": 185,
      "##d5": 186,
      "##d4": 187,
      "##h4": 188,
      "##d8": 189,
      "##xf6": 190,
      "##d1": 191,
      "##b7": 192,
      "##xc6": 193,
      "##g2": 194,
      "##xc3": 195,
      "##xf3": 196,
      "##b2": 197,
      "B-Ra": 198,
      "B-c5": 199,
      "W-Ra": 200,
      "B-e6": 201,
      "##c7": 202,
      "##c2": 203,
      "##xh": 204,
      "B-d6": 205,
      "##c8": 206,
      "W-c4": 207,
      "##f8": 208,
      "##xc4": 209,
      "##c1": 210,
      "##f7": 211,
      "##f1": 212,
      "##b1": 213,
      "##f2": 214,
      "##b8": 215,
      "B-c": 216,
      "ma": 217,
      "##te": 218,
      "mate": 219,
      "##xc5": 220,
      "W-Bc4": 221,
      "B-a6": 222,
      "W-h3": 223,
      "B-h6": 224,
      "B-g6": 225,
      "W-c3": 226,
      "##g8": 227,
      "##xe6": 228,
      "B-Be7": 229,
      "W-Kh": 230,
      "B-c6": 231,
      "##xf5": 232,
      "##xf4": 233,
      "##xg5": 234,
      "##g1": 235,
      "##xd6": 236,
      "W-f4": 237,
      "B-b5": 238,
      "W-c": 239,
      "W-a3": 240,
      "W-Bd3": 241,
      "##7+": 242,
      "W-Re1": 243,
      "##xb5": 244,
      "W-Bg5": 245,
      "W-d3": 246,
      "##xg4": 247,
      "W-Be3": 248,
      "##a5": 249,
      "B-Kh": 250,
      "W-Bb5": 251,
      "W-g3": 252,
      "##a4": 253,
      "B-f5": 254,
      "W-b4": 255,
      "##xd3": 256,
      "##xb4": 257,
      "W-e3": 258,
      "W-e5": 259,
      "##xe3": 260,
      "B-Bg4": 261,
      "W-Be2": 262,
      "##2+": 263,
      "B-Re8": 264,
      "B-f6": 265,
      "##h3": 266,
      "W-g4": 267,
      "B-b6": 268,
      "B-Bd7": 269,
      "B-f": 270,
      "B-a5": 271,
      "W-a4": 272,
      "B-b": 273,
      "B-Bc5": 274,
      "B-Bd6": 275,
      "W-Bf4": 276,
      "W-exd5": 277,
      "W-f": 278,
      "W-f3": 279,
      "W-h4": 280,
      "B-Bb4": 281,
      "W-b3": 282,
      "B-g5": 283,
      "W-b": 284,
      "W-Qx": 285,
      "B-Be6": 286,
      "B-h5": 287,
      "##xd8": 288,
      "B-Bg7": 289,
      "W-Bd2": 290,
      "W-Nxd4": 291,
      "B-Qx": 292,
      "##a6": 293,
      "W-Qe2": 294,
      "B-Ke7": 295,
      "##xe7": 296,
      "##xd1": 297,
      "##xf7": 298,
      "W-Rx": 299,
      "W-Bx": 300,
      "##a3": 301,
      "B-Qe7": 302,
      "B-Bb7": 303,
      "W-Qf3": 304,
      "B-cxd4": 305,
      "B-Kg7": 306,
      "##xd7": 307,
      "B-Rx": 308,
      "W-Ne5": 309,
      "B-g": 310,
      "W-g": 311,
      "B-Kf7": 312,
      "B-Nd7": 313,
      "B-Bf5": 314,
      "W-Kf2": 315,
      "B-exd4": 316,
      "W-Rf": 317,
      "##=Q": 318,
      "W-Ke2": 319,
      "W-Nxe5": 320,
      "W-Kg2": 321,
      "W-Nd2": 322,
      "W-Rh": 323,
      "B-Rh": 324,
      "W-Qd2": 325,
      "W-d5": 326,
      "B-Kf8": 327,
      "##xd2": 328,
      "W-Rd1": 329,
      "W-Ng5": 330,
      "W-Nd5": 331,
      "B-Rf": 332,
      "B-Rd8": 333,
      "W-Kf1": 334,
      "B-Ne4": 335,
      "B-h": 336,
      "B-Rc8": 337,
      "B-Kd7": 338,
      "B-Nd4": 339,
      "##8+": 340,
      "W-dxe5": 341,
      "W-Kh1": 342,
      "B-Qb6": 343,
      "B-Ne7": 344,
      "B-Qf6": 345,
      "B-Qc7": 346,
      "B-Nxd5": 347,
      "B-Nxe4": 348,
      "B-Bx": 349,
      "##1+": 350,
      "B-Qd7": 351,
      "##xe2": 352,
      "B-Kh8": 353,
      "B-Bxf3": 354,
      "W-Rc1": 355,
      "W-Bxf6": 356,
      "##xf2": 357,
      "B-Nxe5": 358,
      "W-Kd2": 359,
      "B-Rb8": 360,
      "B-Rxa": 361,
      "W-Rb1": 362,
      "W-Rxa": 363,
      "##xc7": 364,
      "##xh3": 365,
      "W-Ne4": 366,
      "W-Bxc6": 367,
      "##xg6": 368,
      "W-Qd3": 369,
      "##xc2": 370,
      "W-Kh2": 371,
      "B-Ne5": 372,
      "W-Qc2": 373,
      "B-Bxc3": 374,
      "B-Kf6": 375,
      "B-Ng4": 376,
      "W-Ne2": 377,
      "B-Ke6": 378,
      "B-Nb": 379,
      "W-Bb2": 380,
      "W-Kf3": 381,
      "W-cxd5": 382,
      "W-Bg2": 383,
      "B-Kg8": 384,
      "W-Ke3": 385,
      "W-Bb3": 386,
      "W-Qb3": 387,
      "W-Qh5": 388,
      "B-Qa5": 389,
      "B-Kg6": 390,
      "B-dxe4": 391,
      "B-exd5": 392,
      "W-Kg3": 393,
      "B-Kh7": 394,
      "W-O-O-O": 395,
      "B-Nd5": 396,
      "W-Nb": 397,
      "W-Kg1": 398,
      "B-e4": 399,
      "B-bxc6": 400,
      "W-Nb5": 401,
      "##xg3": 402,
      "B-Nxd4": 403,
      "W-Qxa": 404,
      "B-d4": 405,
      "W-Nxe4": 406,
      "W-bxc3": 407,
      "B-Rf8": 408,
      "W-Rf1": 409,
      "B-Qxa": 410,
      "B-b4": 411,
      "##xf8": 412,
      "B-Qd6": 413,
      "B-dxe5": 414,
      "W-Nd4": 415,
      "B-O-O-O": 416,
      "W-Qxd4": 417,
      "B-Kd6": 418,
      "B-Nbd7": 419,
      "B-Nb4": 420,
      "W-Kd3": 421,
      "##xb3": 422,
      "W-Nbd2": 423,
      "W-g5": 424,
      "W-Nxd5": 425,
      "W-c5": 426,
      "B-Qxd5": 427,
      "W-h5": 428,
      "B-cxd5": 429,
      "B-Rg8": 430,
      "W-cxd4": 431,
      "B-c4": 432,
      "B-Kd8": 433,
      "W-Qa4": 434,
      "B-Ke8": 435,
      "B-dxc4": 436,
      "##xf1": 437,
      "B-a4": 438,
      "##xe8": 439,
      "W-f5": 440,
      "W-Rad1": 441,
      "W-b5": 442,
      "W-a5": 443,
      "B-Kc7": 444,
      "##xe1": 445,
      "B-Qh4": 446,
      "##xh7": 447,
      "W-Qg3": 448,
      "W-Bxa": 449,
      "W-Rg1": 450,
      "W-Qe3": 451,
      "##xf7+": 452,
      "W-Qg4": 453,
      "B-Nc5": 454,
      "B-Bxa": 455,
      "B-g4": 456,
      "W-Kd1": 457,
      "B-Nf5": 458,
      "W-Bb5+": 459,
      "##xc8": 460,
      "W-Rfe1": 461,
      "##a2": 462,
      "W-Nxc6": 463,
      "B-h4": 464,
      "W-Kc2": 465,
      "B-f4": 466,
      "W-Nc4": 467,
      "W-Ke1": 468,
      "B-Bf6": 469,
      "W-dxc5": 470,
      "B-Qg5": 471,
      "W-Nx": 472,
      "B-Rad8": 473,
      "W-Bxd5": 474,
      "B-Kc6": 475,
      "B-Kf5": 476,
      "B-Ng": 477,
      "W-Bg3": 478,
      "B-Nh5": 479,
      "B-Qd8": 480,
      "W-Nf5": 481,
      "##e6+": 482,
      "##xc1": 483,
      "##xh2": 484,
      "##g6+": 485,
      "B-Kx": 486,
      "B-Bb4+": 487,
      "W-Qxf3": 488,
      "W-gxf3": 489,
      "##a7": 490,
      "##xf6+": 491,
      "B-Nf4": 492,
      "B-Bb6": 493,
      "B-Rfe8": 494,
      "B-Na5": 495,
      "B-Bxe5": 496,
      "W-Kf4": 497,
      "##xd7+": 498,
      "##e5+": 499,
      "W-Nxa": 500,
      "B-Ba6": 501,
      "##f6+": 502,
      "W-Bxc4": 503,
      "B-Nx": 504,
      "W-Nh4": 505,
      "B-Ng6": 506,
      "B-gxf6": 507,
      "B-Nb6": 508,
      "B-Ke5": 509,
      "W-Kb1": 510,
      "W-Kc3": 511,
      "B-Bxf6": 512,
      "B-fxe6": 513,
      "##g7+": 514,
      "W-Bf3": 515,
      "B-Bxd4": 516,
      "W-Nf4": 517,
      "B-Qxf6": 518,
      "B-Rd2": 519,
      "B-Bg6": 520,
      "##g3+": 521,
      "W-Qxd5": 522,
      "W-Rd7": 523,
      "##f7+": 524,
      "W-Bh4": 525,
      "B-Bc6": 526,
      "W-Qd1": 527,
      "##e3+": 528,
      "##xf2+": 529,
      "W-Na3": 530,
      "W-Ke4": 531,
      "W-Ng3": 532,
      "W-Bxe5": 533,
      "W-Ba4": 534,
      "B-Qe6": 535,
      "##h6+": 536,
      "##xh8": 537,
      "##f3+": 538,
      "##e7+": 539,
      "W-Bxe4": 540,
      "##xf3+": 541,
      "W-Rac1": 542,
      "B-Kd5": 543,
      "B-Qg6": 544,
      "##d4+": 545,
      "W-Nd6": 546,
      "B-Nh6": 547,
      "##g2+": 548,
      "W-Nc5": 549,
      "##e2+": 550,
      "B-Na6": 551,
      "B-Kg5": 552,
      "W-Kh3": 553,
      "B-Nc4": 554,
      "W-Kg4": 555,
      "W-Qc3": 556,
      "B-Qxd4": 557,
      "B-Rac8": 558,
      "W-fxe5": 559,
      "B-Bxe4": 560,
      "B-Kb8": 561,
      "dr": 562,
      "##aw": 563,
      "draw": 564,
      "B-Nxa": 565,
      "B-Kh6": 566,
      "W-Qd5": 567,
      "B-Qxb2": 568,
      "B-Qc6": 569,
      "W-Rd2": 570,
      "W-Nb3": 571,
      "W-Bxe6": 572,
      "W-Qf4": 573,
      "##e4+": 574,
      "B-Nxc3": 575,
      "B-Qxe5": 576,
      "B-Bh5": 577,
      "##h2": 578,
      "##xd8+": 579,
      "W-Kx": 580,
      "B-Ra8": 581,
      "B-Kb7": 582,
      "B-Rd7": 583,
      "B-exf4": 584,
      "W-Bd5": 585,
      "B-gx": 586,
      "##=Q+": 587,
      "B-Qc5": 588,
      "W-Na4": 589,
      "W-Re3": 590,
      "W-Qxe5": 591,
      "B-Qd5": 592,
      "W-Qc4": 593,
      "W-Bc2": 594,
      "B-Qf5": 595,
      "##f2+": 596,
      "W-Kd4": 597,
      "W-Ba3": 598,
      "W-Ng": 599,
      "W-Qxb7": 600,
      "B-Bxc5": 601,
      "W-Rd": 602,
      "B-fxe5": 603,
      "W-Re2": 604,
      "W-Rc7": 605,
      "B-Qxe4": 606,
      "##e8+": 607,
      "B-Kb6": 608,
      "B-Rf7": 609,
      "##xd1+": 610,
      "W-Ra1": 611,
      "W-Kc1": 612,
      "##e1+": 613,
      "##xb6": 614,
      "B-Kc8": 615,
      "W-Qxe4": 616,
      "B-Bxd5": 617,
      "W-Bc3": 618,
      "W-exf5": 619,
      "##d3+": 620,
      "W-Bxd4": 621,
      "B-Rc2": 622,
      "B-Qb4": 623,
      "B-Kxf7": 624,
      "W-Rfd1": 625,
      "##h7": 626,
      "B-Kc5": 627,
      "B-Re7": 628,
      "W-bxa": 629,
      "##xd2+": 630,
      "W-Bxe7": 631,
      "W-hxg4": 632,
      "W-Qh5+": 633,
      "##a1": 634,
      "W-Nxe6": 635,
      "W-Bh6": 636,
      "W-exf6": 637,
      "W-fxe3": 638,
      "W-Bxc6+": 639,
      "W-d6": 640,
      "B-hxg5": 641,
      "B-Bxc3+": 642,
      "W-Qg5": 643,
      "W-Qh4": 644,
      "B-bxa": 645,
      "##a8": 646,
      "B-Rfd8": 647,
      "W-Ne3": 648,
      "W-exd4": 649,
      "B-Qg4": 650,
      "W-Kb2": 651,
      "W-e6": 652,
      "B-fxe4": 653,
      "##xh1": 654,
      "W-Nh3": 655,
      "W-Nxf6+": 656,
      "W-Bxf4": 657,
      "B-Ke4": 658,
      "W-a6": 659,
      "W-Rf2": 660,
      "W-Qf5": 661,
      "B-axb5": 662,
      "B-Nge7": 663,
      "W-Qb5": 664,
      "W-Qxd3": 665,
      "W-Rd8": 666,
      "W-Bd4": 667,
      "W-Rf3": 668,
      "B-Rd": 669,
      "B-Qf4": 670,
      "W-dxe4": 671,
      "B-Kf4": 672,
      "B-Be5": 673,
      "B-d3": 674,
      "B-Ne6": 675,
      "B-Nxf3+": 676,
      "W-Kg5": 677,
      "B-a3": 678,
      "##d1+": 679,
      "W-Rb7": 680,
      "W-Kb3": 681,
      "B-Bd4": 682,
      "B-Rxb2": 683,
      "W-Nxf7": 684,
      "W-axb4": 685,
      "B-Qa5+": 686,
      "W-Be4": 687,
      "W-Rae1": 688,
      "W-Bxf3": 689,
      "W-Bxd7+": 690,
      "W-Bxh6": 691,
      "B-Rxd8": 692,
      "B-Bg5": 693,
      "B-Bd5": 694,
      "W-Rxe5": 695,
      "W-Kc4": 696,
      "W-Bxd6": 697,
      "W-Rab1": 698,
      "B-Rae8": 699,
      "B-Bxc6": 700,
      "B-Bxd3": 701,
      "W-Kf5": 702,
      "B-Qxg5": 703,
      "##xe7+": 704,
      "W-Qd4": 705,
      "W-Qa4+": 706,
      "B-Kd4": 707,
      "B-Nxe3": 708,
      "W-Rxd1": 709,
      "B-Rb2": 710,
      "B-Re6": 711,
      "W-dxc6": 712,
      "B-Nxd3": 713,
      "B-h3": 714,
      "W-Be5": 715,
      "B-Bxf5": 716,
      "W-Qxc6": 717,
      "B-Qxd6": 718,
      "W-Bxg5": 719,
      "W-Qe4": 720,
      "W-Nxd6": 721,
      "B-Bf8": 722,
      "W-Qh": 723,
      "B-Qxc3": 724,
      "W-Rd6": 725,
      "B-e3": 726,
      "W-axb5": 727,
      "W-Re": 728,
      "W-Ke5": 729,
      "##c6+": 730,
      "##c3+": 731,
      "B-Qh5": 732,
      "B-Kg4": 733,
      "##xe1+": 734,
      "W-Rd3": 735,
      "W-Bxf7+": 736,
      "W-Rxb7": 737,
      "##xe8+": 738,
      "B-Rab8": 739,
      "B-Bxe3": 740,
      "W-fxe4": 741,
      "B-Kc4": 742,
      "B-Qe5": 743,
      "B-dxc3": 744,
      "W-Qe1": 745,
      "B-Qc8": 746,
      "W-h6": 747,
      "B-Be4": 748,
      "B-Bh6": 749,
      "B-Qe8": 750,
      "W-exd6": 751,
      "B-bxc4": 752,
      "##g8+": 753,
      "B-Qxe7": 754,
      "W-Kh4": 755,
      "##b1+": 756,
      "##c1+": 757,
      "B-Ba5": 758,
      "B-Bb5": 759,
      "B-Rd6": 760,
      "B-Nd6": 761,
      "W-Nd3": 762,
      "W-Nc7": 763,
      "##b8+": 764,
      "W-Bxg7": 765,
      "W-Bxc5": 766,
      "B-Nxc4": 767,
      "##8=Q": 768,
      "##h3+": 769,
      "##xe2+": 770,
      "B-Re": 771,
      "B-Rf6": 772,
      "W-gx": 773,
      "W-Rc2": 774,
      "W-Qxg4": 775,
      "B-Nf": 776,
      "B-Bxb2": 777,
      "B-Kh5": 778,
      "W-Rxa7": 779,
      "W-Rxe6": 780,
      "B-Rc7": 781,
      "##c8+": 782,
      "W-Nxg5": 783,
      "B-Rxa2": 784,
      "B-Qh": 785,
      "B-Bxg4": 786,
      "W-Rg3": 787,
      "W-Nxb5": 788,
      "W-Bxc3": 789,
      "W-Qxd6": 790,
      "W-b6": 791,
      "B-axb4": 792,
      "B-b3": 793,
      "W-Qxe6": 794,
      "B-Re2": 795,
      "W-Re7": 796,
      "B-Rh8": 797,
      "B-Rxe4": 798,
      "B-Bxh3": 799,
      "W-Kd5": 800,
      "B-Kxg7": 801,
      "B-Qxd7": 802,
      "B-hxg4": 803,
      "B-cxd6": 804,
      "B-Nxf6": 805,
      "B-Qd4": 806,
      "W-Bg4": 807,
      "W-Bd6": 808,
      "W-Bxb5": 809,
      "W-Rh1": 810,
      "##1=Q": 811,
      "B-Bc8": 812,
      "W-Rd5": 813,
      "W-Kc5": 814,
      "W-c6": 815,
      "B-Bxc4": 816,
      "W-Qxg7": 817,
      "W-Bxf5": 818,
      "B-Ra3": 819,
      "##g1+": 820,
      "B-Qh4+": 821,
      "W-Rxd5": 822,
      "W-bxc5": 823,
      "B-Bxe2": 824,
      "##xh7+": 825,
      "W-Qb4": 826,
      "B-Kb5": 827,
      "W-Ra6": 828,
      "W-Bc5": 829,
      "W-hxg5": 830,
      "W-Qxa7": 831,
      "B-c3": 832,
      "W-Ng4": 833,
      "B-Bxd6": 834,
      "B-Rxe5": 835,
      "W-Ra7": 836,
      "B-hxg6": 837,
      "##xc2+": 838,
      "##f8+": 839,
      "B-Bxf4": 840,
      "B-Qb5": 841,
      "W-Qc1": 842,
      "B-Nxg4": 843,
      "B-Kd3": 844,
      "W-axb3": 845,
      "B-Nd3": 846,
      "W-Rc5": 847,
      "##h5+": 848,
      "B-Qxg2": 849,
      "B-bxc5": 850,
      "W-Nc6": 851,
      "B-Kb4": 852,
      "##f1+": 853,
      "W-Rxe4": 854,
      "B-Rxe8": 855,
      "B-Bxd2+": 856,
      "W-Rb": 857,
      "B-Rxc2": 858,
      "W-Qf2": 859,
      "B-gxf5": 860,
      "W-Ne6": 861,
      "W-Qxd8+": 862,
      "W-Kxf2": 863,
      "B-Kxd8": 864,
      "B-Nc2": 865,
      "B-Rc4": 866,
      "W-Rxd6": 867,
      "B-Rxd4": 868,
      "B-Nxf4": 869,
      "W-Rxd4": 870,
      "B-Bf4": 871,
      "W-Re4": 872,
      "B-Rd5": 873,
      "W-Kb4": 874,
      "W-bxc4": 875,
      "W-Rf4": 876,
      "W-g6": 877,
      "B-Bc4": 878,
      "W-Nxd7": 879,
      "W-Bb4": 880,
      "W-Rc": 881,
      "W-Nxc4": 882,
      "W-Qxc4": 883,
      "##b6+": 884,
      "B-Rc6": 885,
      "B-Bxb4": 886,
      "B-Bh3": 887,
      "W-hxg3": 888,
      "W-a7": 889,
      "B-Qf7": 890,
      "##xc7+": 891,
      "W-f6": 892,
      "W-Qc7": 893,
      "W-dxe6": 894,
      "B-Rf5": 895,
      "B-exf5": 896,
      "B-Bc7": 897,
      "##xf8+": 898,
      "W-Bc1": 899,
      "W-Nf6+": 900,
      "B-Rb3": 901,
      "W-Nge2": 902,
      "W-Qxf6": 903,
      "B-Nc": 904,
      "B-Kc3": 905,
      "B-a2": 906,
      "B-Ra6": 907,
      "W-Rxe1": 908,
      "W-Qxd2": 909,
      "B-Bxg5": 910,
      "B-Kf3": 911,
      "B-Ra7": 912,
      "B-f3": 913,
      "W-Re5": 914,
      "W-Rxf7": 915,
      "B-Qd2": 916,
      "W-Rxc7": 917,
      "B-Rc": 918,
      "W-Qd7": 919,
      "W-Qe6+": 920,
      "W-Bxb7": 921,
      "W-Bf1": 922,
      "B-Rxc3": 923,
      "W-Nxg6": 924,
      "B-Ng5": 925,
      "##h4+": 926,
      "B-Ra2": 927,
      "W-Ba2": 928,
      "B-Qxa2": 929,
      "W-Bh3": 930,
      "W-Nxc5": 931,
      "W-Nxf5": 932,
      "B-Bxb5": 933,
      "W-Rb3": 934,
      "W-Qb7": 935,
      "B-Qxf3": 936,
      "B-Qc4": 937,
      "B-Qxc4": 938,
      "W-Nd": 939,
      "B-Nxb4": 940,
      "B-Rg6": 941,
      "B-Rxe1+": 942,
      "B-Qxf4": 943,
      "B-Qb7": 944,
      "W-Qxc5": 945,
      "B-Kxa": 946,
      "W-Nd6+": 947,
      "B-Nxf2": 948,
      "B-Rd4": 949,
      "W-Qd6": 950,
      "W-Rc3": 951,
      "W-Qxc3": 952,
      "B-Nxc5": 953,
      "W-Kf6": 954,
      "W-Rxc6": 955,
      "B-Rxd5": 956,
      "W-Rxe8+": 957,
      "W-Qh3": 958,
      "W-gxf4": 959,
      "B-Qxd3": 960,
      "W-Rh3": 961,
      "B-Qxc5": 962,
      "W-Qxf5": 963,
      "B-fxg6": 964,
      "B-Qxc6": 965,
      "B-Ra4": 966,
      "W-Nxc3": 967,
      "B-Bd3": 968,
      "W-Qc5": 969,
      "W-Ra5": 970,
      "B-Rb4": 971,
      "B-Nxd7": 972,
      "B-Bxe6": 973,
      "W-Rb5": 974,
      "B-cxb5": 975,
      "W-gxf5": 976,
      "B-Qxc2": 977,
      "W-Bxa6": 978,
      "B-Rb": 979,
      "W-Re1+": 980,
      "B-Qxd1+": 981,
      "B-Rf4": 982,
      "W-Qxf7": 983,
      "B-Ra5": 984,
      "W-Qxe2": 985,
      "W-Kg6": 986,
      "B-Ne3": 987,
      "B-Nf3+": 988,
      "B-Rd1+": 989,
      "B-g3": 990,
      "B-Rxd3": 991,
      "W-cxb5": 992,
      "W-Rxa6": 993,
      "W-Kh5": 994,
      "W-cxd3": 995,
      "W-Kb5": 996,
      "B-Re5": 997,
      "W-Rf5": 998,
      "B-Qc2": 999,
      "W-Ra2": 1000,
      "B-cxb4": 1001,
      "B-Bxa3": 1002,
      "W-Qxg5": 1003,
      "B-Qxe3": 1004,
      "B-exf3": 1005,
      "##xh2+": 1006,
      "B-Rxe3": 1007,
      "W-Rg4": 1008,
      "B-dxc5": 1009,
      "W-Ra3": 1010,
      "B-Rxf2": 1011,
      "W-Kd6": 1012,
      "W-cxb4": 1013,
      "B-Qe3+": 1014,
      "B-Kxd7": 1015,
      "W-fxg3": 1016,
      "B-Bxg2": 1017,
      "B-Ra1": 1018,
      "B-Nxg3": 1019,
      "W-Ke6": 1020,
      "W-Kxd1": 1021,
      "B-Bxf2+": 1022,
      "B-Qd4+": 1023,
      "B-gxh6": 1024,
      "B-Ke3": 1025,
      "W-Rxd8+": 1026,
      "B-Rxd1+": 1027,
      "B-Nc7": 1028,
      "B-Re1+": 1029,
      "W-Ra8": 1030,
      "W-Qxe5+": 1031,
      "B-Nxc6": 1032,
      "W-Re8+": 1033,
      "B-Rb7": 1034,
      "B-dxc6": 1035,
      "W-Rd8+": 1036,
      "W-Qe5": 1037,
      "W-Nxf3": 1038,
      "W-Bf2": 1039,
      "B-Nxd2": 1040,
      "B-Rc5": 1041,
      "##xf1+": 1042,
      "W-Rc6": 1043,
      "B-Rxc4": 1044,
      "B-Ne8": 1045,
      "W-Nc": 1046,
      "W-Qxh7": 1047,
      "B-Qb2": 1048,
      "B-Nxb3": 1049,
      "W-Qe5+": 1050,
      "B-Kb3": 1051,
      "B-Ka6": 1052,
      "B-Nc3": 1053,
      "B-Qe4": 1054,
      "W-Rd4": 1055,
      "B-Qe4+": 1056,
      "B-Rfc8": 1057,
      "W-Bf5": 1058,
      "B-Kg3": 1059,
      "W-Qxb5": 1060,
      "B-Rd3": 1061,
      "W-Qd5+": 1062,
      "B-Rxf7": 1063,
      "B-Rb6": 1064,
      "W-Qxf4": 1065,
      "W-Qxc7": 1066,
      "W-dxc4": 1067,
      "B-Qe5+": 1068,
      "W-Rxc5": 1069,
      "B-Qxh3": 1070,
      "B-gxf4": 1071,
      "B-Ne2+": 1072,
      "W-Qxf7+": 1073,
      "B-Qxe4+": 1074,
      "W-Bxf8": 1075,
      "B-Rxc8": 1076,
      "B-axb6": 1077,
      "W-Rfc1": 1078,
      "B-Rd2+": 1079,
      "W-Nf": 1080,
      "W-Nh2": 1081,
      "B-Rxf4": 1082,
      "W-Qxe3": 1083,
      "W-Qb5+": 1084,
      "W-Rxd8": 1085,
      "W-Rg5": 1086,
      "W-Rd7+": 1087,
      "W-Qb2": 1088,
      "W-Rxf5": 1089,
      "W-Qd8": 1090,
      "B-Kh4": 1091,
      "W-Nxa8": 1092,
      "B-Rxa3": 1093,
      "W-Nc2": 1094,
      "W-Kxg2": 1095,
      "W-Qxe6+": 1096,
      "W-Rxf6": 1097,
      "B-Qh6": 1098,
      "W-Kc6": 1099,
      "W-d7": 1100,
      "W-Rc4": 1101,
      "B-Ka7": 1102,
      "W-Qxh6": 1103,
      "B-Re4": 1104,
      "W-Qf5+": 1105,
      "W-Nd7": 1106,
      "W-Ne7+": 1107,
      "W-Rxh7": 1108,
      "B-Kxf8": 1109,
      "B-Rxa4": 1110,
      "W-Nf1": 1111,
      "B-Rg4": 1112,
      "W-Ka2": 1113,
      "B-Qf4+": 1114,
      "W-fxg5": 1115,
      "B-Bxf1": 1116,
      "B-fxg4": 1117,
      "B-Bxa1": 1118,
      "B-Bd8": 1119,
      "B-h2": 1120,
      "B-Rg7": 1121,
      "B-Rxf8": 1122,
      "B-Re8+": 1123,
      "W-Bxg6": 1124,
      "B-c2": 1125,
      "W-c7": 1126,
      "B-Qxg4": 1127,
      "W-Bxa8": 1128,
      "B-Rxd1": 1129,
      "B-fxg5": 1130,
      "W-Rg2": 1131,
      "B-Rxf6": 1132,
      "B-Qxh2": 1133,
      "W-Bxb4": 1134,
      "W-Rxe7": 1135,
      "B-Qb8": 1136,
      "B-Re2+": 1137,
      "W-Rhe1": 1138,
      "W-Rxa5": 1139,
      "B-Nfd7": 1140,
      "W-Bxc7": 1141,
      "B-Bc3": 1142,
      "W-Qa": 1143,
      "B-Qxf2+": 1144,
      "B-Ngf6": 1145,
      "B-Nd": 1146,
      "B-Rh6": 1147,
      "B-Rxf3": 1148,
      "W-Kxf1": 1149,
      "B-Qxe6": 1150,
      "W-h7": 1151,
      "W-Kxa": 1152,
      "W-Ka1": 1153,
      "W-Nxc7": 1154,
      "B-Kxe7": 1155,
      "W-hxg6": 1156,
      "B-Rxf5": 1157,
      "W-Qxa6": 1158,
      "W-Rb2": 1159,
      "B-Rc3": 1160,
      "B-Rg5": 1161,
      "B-b2": 1162,
      "W-fxg4": 1163,
      "W-Rxc1": 1164,
      "B-d2": 1165,
      "W-Ra4": 1166,
      "W-Nxd2": 1167,
      "W-Rxf4": 1168,
      "B-Nb8": 1169,
      "W-Qe8+": 1170,
      "W-Qf7+": 1171,
      "B-Qa3": 1172,
      "W-Rh8": 1173,
      "B-Rb5": 1174,
      "W-Kxe2": 1175,
      "B-Qg5+": 1176,
      "W-gxh3": 1177,
      "B-Nd3+": 1178,
      "W-Qa3": 1179,
      "W-b7": 1180,
      "W-Rb6": 1181,
      "W-Rxd3": 1182,
      "W-Rc8": 1183,
      "B-Qf8": 1184,
      "W-Ne1": 1185,
      "B-Qxf5": 1186,
      "W-Ka3": 1187,
      "B-Nxc2": 1188,
      "W-Rh5": 1189,
      "B-Qa6": 1190,
      "W-Rxe3": 1191,
      "B-Qe1+": 1192,
      "B-Rh7": 1193,
      "B-Ne": 1194,
      "B-Bxc2": 1195,
      "W-Qf6+": 1196,
      "B-Qxf2": 1197,
      "W-Rb4": 1198,
      "W-Rh4": 1199,
      "W-Qh6": 1200,
      "W-Qxh5": 1201,
      "W-Rb8": 1202,
      "W-Re7+": 1203,
      "B-Qxb4": 1204,
      "W-Qg4+": 1205,
      "W-Bxg4": 1206,
      "B-Rb1": 1207,
      "B-Qxb5": 1208,
      "W-Bc6": 1209,
      "W-Re8": 1210,
      "B-Qa": 1211,
      "W-bxa5": 1212,
      "B-Nh7": 1213,
      "B-Rhe8": 1214,
      "W-Ne5+": 1215,
      "B-Qb4+": 1216,
      "W-Ne": 1217,
      "W-Qf7": 1218,
      "B-Nxa1": 1219,
      "B-bxa4": 1220,
      "B-Be8": 1221,
      "B-Qc3": 1222,
      "B-Qg7": 1223,
      "B-Qa4": 1224,
      "W-Rxd7": 1225,
      "W-Qe2+": 1226,
      "B-Qxa3": 1227,
      "B-Bf7": 1228,
      "W-Rxf1": 1229,
      "##xc8+": 1230,
      "B-Bc5+": 1231,
      "B-Qxh4": 1232,
      "W-Bd1": 1233,
      "W-Rf7+": 1234,
      "B-Rxd6": 1235,
      "W-Qa6": 1236,
      "B-Rxb3": 1237,
      "W-Rh2": 1238,
      "B-Nd2": 1239,
      "B-Rxe6": 1240,
      "W-Kxd2": 1241,
      "W-Rxf8+": 1242,
      "W-Rc7+": 1243,
      "W-Qc8+": 1244,
      "B-Qc1+": 1245,
      "W-Nb6": 1246,
      "W-Bxd8": 1247,
      "B-Kc2": 1248,
      "W-Kb6": 1249,
      "W-Rxb5": 1250,
      "B-bxc3": 1251,
      "B-Qb6+": 1252,
      "B-Ka5": 1253,
      "B-Nb3": 1254,
      "B-Nf8": 1255,
      "W-Rxc4": 1256,
      "B-Rd1": 1257,
      "W-Qxb4": 1258,
      "W-Qxa8": 1259,
      "B-Ng8": 1260,
      "W-Nxf4": 1261,
      "W-Rxf2": 1262,
      "B-Bxd2": 1263,
      "W-Rxe8": 1264,
      "B-Bxe7": 1265,
      "B-Ka8": 1266,
      "B-Rh1": 1267,
      "B-Re3": 1268,
      "W-Rd1+": 1269,
      "B-Qc5+": 1270,
      "B-Rxh3": 1271,
      "W-Qf1": 1272,
      "B-Rc2+": 1273,
      "W-Qg7": 1274,
      "W-Ka4": 1275,
      "B-Rxh2": 1276,
      "W-Qg2": 1277,
      "W-Bxa7": 1278,
      "W-Rxd2": 1279,
      "W-Qe7+": 1280,
      "##xc1+": 1281,
      "B-Nxf5": 1282,
      "W-Qb1": 1283,
      "B-Qf2+": 1284,
      "B-Rxd2": 1285,
      "W-Ngf3": 1286,
      "W-exf4": 1287,
      "W-Nb4": 1288,
      "B-Nxg5": 1289,
      "W-Re6": 1290,
      "B-Qe2": 1291,
      "B-Bxg3": 1292,
      "B-Bxd7": 1293,
      "B-Rc1": 1294,
      "W-Qc4+": 1295,
      "W-Nc7+": 1296,
      "B-Qd1+": 1297,
      "W-Bxd3": 1298,
      "B-Qh3": 1299,
      "B-Kb2": 1300,
      "W-Qg5+": 1301,
      "W-Qd8+": 1302,
      "B-Rh4": 1303,
      "W-Bc4+": 1304,
      "W-Rh7": 1305,
      "B-Bxd1": 1306,
      "W-Rxf3": 1307,
      "W-Qh8+": 1308,
      "B-Rf2": 1309,
      "W-e7": 1310,
      "W-Rxh6": 1311,
      "B-gxh4": 1312,
      "B-Rc1+": 1313,
      "W-Qxc6+": 1314,
      "B-Re1": 1315,
      "W-Qxd7": 1316,
      "B-Qxb3": 1317,
      "B-Bh4": 1318,
      "B-Rxb4": 1319,
      "W-Qxd8": 1320,
      "W-Qg6+": 1321,
      "W-Nxb7": 1322,
      "W-Rb7+": 1323,
      "W-Rc8+": 1324,
      "B-Rxd7": 1325,
      "B-Rxf1+": 1326,
      "W-Qc6": 1327,
      "B-Qg2": 1328,
      "B-Qxe2+": 1329,
      "B-Rxg2": 1330,
      "W-Rxc8": 1331,
      "B-Rxc5": 1332,
      "W-Qxe7": 1333,
      "B-Qf3+": 1334,
      "B-Rxe2": 1335,
      "W-Qa5": 1336,
      "W-Rxg7": 1337,
      "W-Rxg5": 1338,
      "B-Rxe7": 1339,
      "W-Rxa1": 1340,
      "W-Bf6": 1341,
      "B-Rxa8": 1342,
      "W-Bc7": 1343,
      "B-Bf3": 1344,
      "B-Qxd1": 1345,
      "B-exd3": 1346,
      "W-Nd5+": 1347,
      "W-Nxd6+": 1348,
      "B-Qd3": 1349,
      "W-Ng5+": 1350,
      "B-Qxa4": 1351,
      "B-Nh4": 1352,
      "W-Kh6": 1353,
      "W-Nf2": 1354,
      "B-Nb5": 1355,
      "W-Bh2": 1356,
      "B-Rh5": 1357,
      "B-Ra1+": 1358,
      "W-Rxb6": 1359,
      "B-Nxd3+": 1360,
      "B-Qxe3+": 1361,
      "W-Rf6": 1362,
      "B-Rf2+": 1363,
      "B-Qxd2": 1364,
      "W-Qf3+": 1365,
      "W-gxh5": 1366,
      "B-Ba7": 1367,
      "B-Kxf6": 1368,
      "B-Bxb3": 1369,
      "B-Rb2+": 1370,
      "W-Nxg4": 1371,
      "W-Qxd7+": 1372,
      "W-Nh5": 1373,
      "W-Nxh8": 1374,
      "W-Qxh8": 1375,
      "B-Ne4+": 1376,
      "B-Ba4": 1377,
      "W-Rg7+": 1378,
      "W-a8=Q": 1379,
      "W-Bh5": 1380,
      "W-Qe7": 1381,
      "B-gxh5": 1382,
      "B-Qg4+": 1383,
      "B-Be3": 1384,
      "W-Qe4+": 1385,
      "B-Ra2+": 1386,
      "B-Nxb2": 1387,
      "B-Nxc2+": 1388,
      "W-R1": 1389,
      "B-Ka4": 1390,
      "W-Nb1": 1391,
      "W-Ne6+": 1392,
      "W-Be1": 1393,
      "W-Rh6": 1394,
      "W-Qxb6": 1395,
      "W-Ke7": 1396,
      "B-Nf7": 1397,
      "B-Nxe7": 1398,
      "W-Ba5": 1399,
      "B-Rxc1": 1400,
      "B-dxe3": 1401,
      "W-g7": 1402,
      "W-Nf7": 1403,
      "W-Nxe7+": 1404,
      "B-Qf2": 1405,
      "W-Na5": 1406,
      "W-Rg": 1407,
      "W-Rf7": 1408,
      "W-Rxe2": 1409,
      "W-Qxe7+": 1410,
      "W-Nxc7+": 1411,
      "W-Bb1": 1412,
      "W-Bxe3": 1413,
      "B-Qb3": 1414,
      "B-Kd2": 1415,
      "W-Rxa4": 1416,
      "W-Nf5+": 1417,
      "W-Rxh5": 1418,
      "W-Qxa5": 1419,
      "W-Nf7+": 1420,
      "B-R8": 1421,
      "B-Ke2": 1422,
      "W-fxg6": 1423,
      "W-bxc6": 1424,
      "B-Rxg4": 1425,
      "B-Rb1+": 1426,
      "B-Qc3+": 1427,
      "W-Kg7": 1428,
      "W-Bxb6": 1429,
      "W-Rb8+": 1430,
      "W-Rhg1": 1431,
      "B-Rxa5": 1432,
      "W-Ng6": 1433,
      "W-Be7": 1434,
      "W-Bxf7": 1435,
      "B-Qxc7": 1436,
      "B-e2": 1437,
      "B-Rxh4": 1438,
      "W-Rg7": 1439,
      "B-Kxh7": 1440,
      "B-Rh2": 1441,
      "##1=Q+": 1442,
      "B-Ng3": 1443,
      "B-Kf2": 1444,
      "B-cxb3": 1445,
      "##h8": 1446,
      "W-Bb6": 1447,
      "B-Rxc6": 1448,
      "W-Qc6+": 1449,
      "B-Qg3+": 1450,
      "W-Kc7": 1451,
      "B-Bxa2": 1452,
      "W-Qh6+": 1453,
      "B-a1=Q": 1454,
      "W-Qc7+": 1455,
      "W-Rg8+": 1456,
      "B-Kxe6": 1457,
      "B-Ka3": 1458,
      "B-Qxa1": 1459,
      "B-Nc2+": 1460,
      "W-Nxe7": 1461,
      "W-Be6": 1462,
      "B-Rxe1": 1463,
      "W-Ra7+": 1464,
      "B-Qxc3+": 1465,
      "B-Be2": 1466,
      "W-Rf8+": 1467,
      "W-Qf8+": 1468,
      "W-Kd7": 1469,
      "W-Nxf6": 1470,
      "W-Nd1": 1471,
      "B-Ne3+": 1472,
      "W-Kf7": 1473,
      "W-f7": 1474,
      "B-Rf3": 1475,
      "B-fxg3": 1476,
      "B-Qxg3": 1477,
      "B-Rde8": 1478,
      "B-Na4": 1479,
      "W-Bxd7": 1480,
      "B-Rh3": 1481,
      "B-Rhg8": 1482,
      "B-Rd8+": 1483,
      "W-Qxd5+": 1484,
      "W-Nxc8": 1485,
      "B-Rg": 1486,
      "W-Nxb6": 1487,
      "B-Qh1+": 1488,
      "W-Bxd2": 1489,
      "B-Rg2+": 1490,
      "W-Rxb2": 1491,
      "B-Nd8": 1492,
      "W-Qd7+": 1493,
      "B-b1": 1494,
      "B-Rxb8": 1495,
      "W-Qa8+": 1496,
      "B-g2": 1497,
      "B-Kg2": 1498,
      "W-Nxf8": 1499,
      "W-Rxc3": 1500,
      "W-Rf8": 1501,
      "W-Qb8+": 1502,
      "B-Qg1+": 1503,
      "B-Rhf8": 1504,
      "B-hxg3": 1505,
      "B-Qd2+": 1506,
      "B-Qf1+": 1507,
      "B-axb3": 1508,
      "W-Qf6": 1509,
      "B-Qb1+": 1510,
      "B-Kh3": 1511,
      "W-Qxg6": 1512,
      "##8=Q+": 1513,
      "W-Bxh7+": 1514,
      "W-Kxf3": 1515,
      "B-Raf8": 1516,
      "B-Bxh4": 1517,
      "W-Rd6+": 1518,
      "W-Ba6": 1519,
      "B-Bd4+": 1520,
      "W-Qd4+": 1521,
      "B-Qe2+": 1522,
      "W-cxb6": 1523,
      "B-Qe7+": 1524,
      "B-c1": 1525,
      "W-Nxe2": 1526,
      "B-Bc2": 1527,
      "B-Rxg5": 1528,
      "B-Rxc7": 1529,
      "W-Kxh2": 1530,
      "B-Rxa1": 1531,
      "W-Nf6": 1532,
      "W-Nxd8": 1533,
      "W-Rxb4": 1534,
      "W-Red1": 1535,
      "##h1": 1536,
      "B-f2": 1537,
      "W-Bxh8": 1538,
      "B-Bd2": 1539,
      "W-Rg6": 1540,
      "W-Rxc2": 1541,
      "B-Rf1": 1542,
      "W-Qxf7#": 1543,
      "W-Bg5+": 1544,
      "W-Bxe2": 1545,
      "B-Rf1+": 1546,
      "W-Qg8+": 1547,
      "W-fxe6": 1548,
      "W-bxa3": 1549,
      "B-Ba3": 1550,
      "W-Qg6": 1551,
      "B-Rxg2+": 1552,
      "B-Nce7": 1553,
      "W-c8": 1554,
      "W-Ra8+": 1555,
      "B-Rh1+": 1556,
      "W-Qxc2": 1557,
      "W-Rxb1": 1558,
      "W-Rxg7+": 1559,
      "B-Nf2+": 1560,
      "W-Qxg6+": 1561,
      "W-Rhf1": 1562,
      "W-Qh7+": 1563,
      "B-Qxd4+": 1564,
      "W-Qd6+": 1565,
      "B-Qa1+": 1566,
      "B-Qd5+": 1567,
      "W-Rde1": 1568,
      "W-Nxb4": 1569,
      "W-cxd6": 1570,
      "W-Rh8+": 1571,
      "W-gxh4": 1572,
      "W-Qe6": 1573,
      "W-Bxh5": 1574,
      "W-Nxa7": 1575,
      "B-Ra3+": 1576,
      "B-Kxd6": 1577,
      "B-cxd3": 1578,
      "B-Qxg3+": 1579,
      "W-b8": 1580,
      "B-Bh7": 1581,
      "W-Rxf7+": 1582,
      "B-Rhd8": 1583,
      "B-Nf3": 1584,
      "B-Bb3": 1585,
      "W-Qxe1": 1586,
      "B-Kxe5": 1587,
      "B-Nd4+": 1588,
      "B-Nbc6": 1589,
      "B-Bg4+": 1590,
      "W-Rxa8": 1591,
      "B-bxa6": 1592,
      "B-Qf3": 1593,
      "B-Qe6+": 1594,
      "W-Qb3+": 1595,
      "B-Qxa8": 1596,
      "W-Qb7+": 1597,
      "B-Rxb5": 1598,
      "B-Qg3": 1599,
      "W-Rfb1": 1600,
      "W-Bxa5": 1601,
      "B-Qc2+": 1602,
      "B-Nxb5": 1603,
      "W-Qxb3": 1604,
      "B-Bxf2": 1605,
      "W-Re6+": 1606,
      "W-Ka5": 1607,
      "B-Rh2+": 1608,
      "B-Bxh6": 1609,
      "B-Nf4+": 1610,
      "B-Nf2": 1611,
      "W-Rg8": 1612,
      "W-Kb7": 1613,
      "W-Rh7+": 1614,
      "W-g8": 1615,
      "B-Nxf3": 1616,
      "B-Rd3+": 1617,
      "W-Qxf6+": 1618,
      "W-Qxh7+": 1619,
      "B-Qe3": 1620,
      "B-Qxe8": 1621,
      "B-Nxh5": 1622,
      "W-Bxe6+": 1623,
      "B-Qd3+": 1624,
      "B-Bxa4": 1625,
      "W-Qf4+": 1626,
      "B-Qc4+": 1627,
      "W-Qg7#": 1628,
      "W-Rf6+": 1629,
      "W-Raf1": 1630,
      "B-Rxb7": 1631,
      "W-f8": 1632,
      "W-Ng1": 1633,
      "B-Rg1": 1634,
      "B-Qxd2+": 1635,
      "B-Kxg5": 1636,
      "##xb2": 1637,
      "W-h8=Q": 1638,
      "W-Rhd1": 1639,
      "B-Nxe6": 1640,
      "B-Nxf1": 1641,
      "B-Qxe2": 1642,
      "B-Qa7": 1643,
      "W-Rf1+": 1644,
      "B-Be3+": 1645,
      "B-Rg2": 1646,
      "W-Rxg6": 1647,
      "W-Rxg4": 1648,
      "W-cxb3": 1649,
      "W-Nxh4": 1650,
      "W-Kxd3": 1651,
      "W-Kxe1": 1652,
      "B-Nc8": 1653,
      "B-exf6": 1654,
      "B-Rxg3": 1655,
      "B-Bxe1": 1656,
      "B-Nxe2+": 1657,
      "B-Qg2+": 1658,
      "W-Kxf4": 1659,
      "W-Qxa1": 1660,
      "W-Qh7": 1661,
      "B-Qxf7": 1662,
      "W-dxc3": 1663,
      "B-Ng4+": 1664,
      "W-bxa4": 1665,
      "B-Re3+": 1666,
      "W-gxf6": 1667,
      "W-Nfd2": 1668,
      "W-Qb6": 1669,
      "W-Qg7+": 1670,
      "W-Qxe8+": 1671,
      "B-Kxe8": 1672,
      "B-Rc3+": 1673,
      "B-Qxh1": 1674,
      "W-Kxe3": 1675,
      "B-bxa5": 1676,
      "B-Qxg2#": 1677,
      "W-Qc5+": 1678,
      "B-Bxc1": 1679,
      "B-Rg3": 1680,
      "B-Rfb8": 1681,
      "B-Qf5+": 1682,
      "B-Red8": 1683,
      "B-Qh2+": 1684,
      "B-g1": 1685,
      "B-Bxh2+": 1686,
      "B-Kxf5": 1687,
      "B-h1=Q": 1688,
      "B-Rf8+": 1689,
      "B-Nxd1": 1690,
      "B-Qxe5+": 1691,
      "W-Ra6+": 1692,
      "B-Qg2#": 1693,
      "B-Kxg6": 1694,
      "W-Bxb8": 1695,
      "W-Qc3+": 1696,
      "W-Ndf3": 1697,
      "B-b1=Q": 1698,
      "B-f1": 1699,
      "W-Rb6+": 1700,
      "W-Bxg8": 1701,
      "W-Qxg7#": 1702,
      "B-Ng7": 1703,
      "B-Qxf8": 1704,
      "B-Rxa7": 1705,
      "W-Nbc3": 1706,
      "B-Rf3+": 1707,
      "W-Kxe4": 1708,
      "W-Kxg4": 1709,
      "W-Nxa5": 1710,
      "B-Nxh3": 1711,
      "W-Bd7": 1712,
      "W-Rxe7+": 1713,
      "B-Qg6+": 1714,
      "B-Qh3+": 1715,
      "W-Rxh4": 1716,
      "B-Bxh1": 1717,
      "B-Rg1+": 1718,
      "W-axb6": 1719,
      "W-Nc1": 1720,
      "W-Nxh7": 1721,
      "B-Qxe1+": 1722,
      "W-Qe3+": 1723,
      "B-Nxc1": 1724,
      "B-Bb2": 1725,
      "W-Ka6": 1726,
      "##xh1+": 1727,
      "B-Nxa4": 1728,
      "W-Qh4+": 1729,
      "B-Rxf2+": 1730,
      "B-Qa8": 1731,
      "B-Qxb6": 1732,
      "B-Rb3+": 1733,
      "W-Qf7#": 1734,
      "B-Qxa5": 1735,
      "W-Kxg3": 1736,
      "B-Rxa6": 1737,
      "W-Rg1+": 1738,
      "W-bxa6": 1739,
      "W-Qxa4": 1740,
      "B-Ng3+": 1741,
      "B-Ka2": 1742,
      "W-Bxf6+": 1743,
      "W-Rxa3": 1744,
      "B-Nb7": 1745,
      "W-Be6+": 1746,
      "W-Qxf2": 1747,
      "##xh8+": 1748,
      "W-Bxb2": 1749,
      "B-Qf6+": 1750,
      "B-bxa3": 1751,
      "W-Nxd1": 1752,
      "B-Nxh1": 1753,
      "B-Kxf4": 1754,
      "B-cxb6": 1755,
      "W-Qxa8+": 1756,
      "W-Nc6+": 1757,
      "W-Bb7": 1758,
      "W-Rh6+": 1759,
      "W-Rxf8": 1760,
      "B-Qxg2+": 1761,
      "W-Qd3+": 1762,
      "B-Bxd4+": 1763,
      "B-Nxe2": 1764,
      "W-Bg6": 1765,
      "B-Bg3": 1766,
      "W-Nxa4": 1767,
      "W-Nb7": 1768,
      "B-Nxd8": 1769,
      "W-Qxf8+": 1770,
      "B-gxf3": 1771,
      "W-Ne4+": 1772,
      "W-Qg3+": 1773,
      "B-c1=Q": 1774,
      "B-Nb2": 1775,
      "W-Rc6+": 1776,
      "W-Rxc8+": 1777,
      "B-Rxf1": 1778,
      "B-Rxc1+": 1779,
      "B-Qxf3+": 1780,
      "B-Kxd5": 1781,
      "B-Qd6+": 1782,
      "W-Nc5+": 1783,
      "W-Rxe6+": 1784,
      "B-Kxg4": 1785,
      "B-Kxc7": 1786,
      "B-Rxb1": 1787,
      "B-Nxa3": 1788,
      "B-Qb2+": 1789,
      "##h7+": 1790,
      "W-Nxd3": 1791,
      "W-Rg6+": 1792,
      "B-Qxa1+": 1793,
      "W-Na2": 1794,
      "W-Bxh7": 1795,
      "B-Qh2": 1796,
      "W-Kxh5": 1797,
      "W-gxh6": 1798,
      "W-b8=Q": 1799,
      "B-Qxh2+": 1800,
      "B-Kxc6": 1801,
      "W-Kxc2": 1802,
      "B-cxb2": 1803,
      "W-Nce2": 1804,
      "B-Bb8": 1805,
      "B-Qxc2+": 1806,
      "W-Kxf5": 1807,
      "B-gxh3": 1808,
      "W-Rxa2": 1809,
      "B-Nxa2": 1810,
      "W-c8=Q": 1811,
      "W-Ng2": 1812,
      "B-Nxd6": 1813,
      "B-Na7": 1814,
      "W-Qxc8+": 1815,
      "W-Kxg5": 1816,
      "B-Rxh5": 1817,
      "W-Rdf1": 1818,
      "W-Rcd1": 1819,
      "W-Nb2": 1820,
      "W-Bxc8": 1821,
      "B-g5+": 1822,
      "W-Qh8": 1823,
      "W-Ng6+": 1824,
      "W-Nh6+": 1825,
      "B-Rg3+": 1826,
      "B-Rxc2+": 1827,
      "W-Qxf1": 1828,
      "W-Qa2": 1829,
      "B-Qxc1+": 1830,
      "W-Qxb2": 1831,
      "W-Bxd5+": 1832,
      "B-Qc6+": 1833,
      "W-Kxc3": 1834,
      "W-Qxg7+": 1835,
      "W-Nxa6": 1836,
      "B-Bxe3+": 1837,
      "W-Qxg5+": 1838,
      "W-g8=Q": 1839,
      "W-Nxe3": 1840,
      "W-g4+": 1841,
      "B-Bxf3+": 1842,
      "B-Bf4+": 1843,
      "B-Rcd8": 1844,
      "B-Qe1": 1845,
      "W-Nd7+": 1846,
      "B-Bxb1": 1847,
      "B-Nxh4": 1848,
      "W-Rdg1": 1849,
      "W-Qxf5+": 1850,
      "##xg7": 1851,
      "B-Bxd8": 1852,
      "W-Re5+": 1853,
      "W-Nxg7": 1854,
      "B-Qh1": 1855,
      "W-Qxh7#": 1856,
      "##xb7": 1857,
      "B-Nxh2": 1858,
      "W-Bxe8": 1859,
      "W-Rxh1": 1860,
      "W-Qe8": 1861,
      "B-Kb1": 1862,
      "B-Rg8+": 1863,
      "B-Kxh4": 1864,
      "W-Rbc1": 1865,
      "W-Qxb5+": 1866,
      "B-Qxg4+": 1867,
      "W-Nxf7+": 1868,
      "B-Rxg8": 1869,
      "W-Rc1+": 1870,
      "W-Rxe5+": 1871,
      "B-Qh5+": 1872,
      "W-Rd5+": 1873,
      "W-Rg5+": 1874,
      "W-Bg7": 1875,
      "B-Kd1": 1876,
      "B-Rxh6": 1877,
      "B-Rxb6": 1878,
      "W-Qb4+": 1879,
      "B-Ndf6": 1880,
      "W-Bh5+": 1881,
      "B-Re4+": 1882,
      "B-Qd1": 1883,
      "B-Kxc5": 1884,
      "W-Kh7": 1885,
      "B-Nxa5": 1886,
      "W-Bd5+": 1887,
      "B-Nh": 1888,
      "W-Qg1": 1889,
      "W-Rxb3": 1890,
      "W-Rf4+": 1891,
      "W-f8=Q": 1892,
      "B-Qxc8": 1893,
      "W-Rxg1": 1894,
      "B-Kxh5": 1895,
      "W-Nxe8": 1896,
      "B-Nc3+": 1897,
      "B-Rxh8": 1898,
      "B-Rxe2+": 1899,
      "W-Qh2": 1900,
      "B-dxe6": 1901,
      "W-Bf4+": 1902,
      "W-Bxb5+": 1903,
      "B-g1=Q": 1904,
      "B-Nxe1": 1905,
      "B-Qxb7": 1906,
      "W-Rxg2": 1907,
      "B-Rf4+": 1908,
      "B-Qxf2#": 1909,
      "W-Bxd1": 1910,
      "W-Rxh8": 1911,
      "B-Qh7": 1912,
      "B-Kxc4": 1913,
      "B-fxe3": 1914,
      "B-Qxf4+": 1915,
      "B-Rg4+": 1916,
      "W-Ne7": 1917,
      "B-Nxf2+": 1918,
      "B-Nh3+": 1919,
      "W-Bf7": 1920,
      "B-Bf2": 1921,
      "B-Rh3+": 1922,
      "W-Qf8": 1923,
      "W-Qxh3": 1924,
      "W-Kxh3": 1925,
      "B-Kxb7": 1926,
      "B-Nc4+": 1927,
      "W-Nxe6+": 1928,
      "W-Be5+": 1929,
      "W-Qh3+": 1930,
      "B-Qxh1+": 1931,
      "W-Nxh5": 1932,
      "B-Nxb6": 1933,
      "W-Kxh4": 1934,
      "B-Nd2+": 1935,
      "B-Qf2#": 1936,
      "B-Qb5+": 1937,
      "W-Rf5+": 1938,
      "W-Bd8": 1939,
      "W-Rxc7+": 1940,
      "W-Qxd1": 1941,
      "B-Rxg7": 1942,
      "W-Nxa3": 1943,
      "B-Nxh6": 1944,
      "B-Ne2": 1945,
      "W-Rg3+": 1946,
      "B-Qxd8": 1947,
      "B-Qxg7": 1948,
      "W-Rxb8": 1949,
      "B-Rdf8": 1950,
      "W-Rbd1": 1951,
      "B-Qxd3+": 1952,
      "B-Rbd8": 1953,
      "B-f1=Q": 1954,
      "B-Bxh2": 1955,
      "W-Qxh8+": 1956,
      "W-Ke8": 1957,
      "B-d1=Q": 1958,
      "B-Kh2": 1959,
      "B-Bxa6": 1960,
      "W-Qxe4+": 1961,
      "W-Rxd7+": 1962,
      "B-Qc1": 1963,
      "W-Kg8": 1964,
      "W-d8=Q": 1965,
      "B-Bf5+": 1966,
      "B-Kxh6": 1967,
      "##xg2": 1968,
      "B-Nxg6": 1969,
      "W-Bc6+": 1970,
      "W-Qxf8": 1971,
      "W-Qa1": 1972,
      "B-Qa2": 1973,
      "B-Qxf1+": 1974,
      "B-Rc8+": 1975,
      "W-Bxa4": 1976,
      "B-Nxa6": 1977,
      "W-Rc5+": 1978,
      "B-Bxf8": 1979,
      "B-Bh4+": 1980,
      "W-Qa7": 1981,
      "W-Qxc7+": 1982,
      "B-Qf1": 1983,
      "W-Kxd4": 1984,
      "W-Qxh6+": 1985,
      "W-Nxe5+": 1986,
      "B-Nxg2": 1987,
      "W-Qxc8": 1988,
      "B-Ka1": 1989,
      "W-Rxg3": 1990,
      "W-Qxd6+": 1991,
      "B-Rxe4+": 1992,
      "B-Qxh2#": 1993,
      "W-Rh5+": 1994,
      "B-Rxh1": 1995,
      "B-Kxe4": 1996,
      "B-Kc1": 1997,
      "B-Kg1": 1998,
      "W-Kxc4": 1999,
      "W-Qxg3": 2000,
      "W-Nd4+": 2001,
      "W-g5+": 2002,
      "B-Ba8": 2003,
      "B-Rxh7": 2004,
      "B-Qg8": 2005,
      "W-Kxe5": 2006,
      "W-Rxh3": 2007,
      "B-Qxe1": 2008,
      "W-Kd8": 2009,
      "W-Qxg8+": 2010,
      "W-Qxh5+": 2011,
      "B-Rxg3+": 2012,
      "B-Kxg8": 2013,
      "B-Rf5+": 2014,
      "B-Ra4+": 2015,
      "B-Rbc8": 2016,
      "W-Nxb3": 2017,
      "B-Kxb5": 2018,
      "B-Kxb4": 2019,
      "B-Kxh3": 2020,
      "B-Qxg6": 2021,
      "B-Bxb4+": 2022,
      "W-Bf7+": 2023,
      "B-Bg2": 2024,
      "B-Qa1": 2025,
      "B-Kxd4": 2026,
      "B-f5+": 2027,
      "B-Na": 2028,
      "W-Bg6+": 2029,
      "B-Rd4+": 2030,
      "W-Qxe8": 2031,
      "W-Kf8": 2032,
      "W-Kxg6": 2033,
      "W-f4+": 2034,
      "W-Qxh4": 2035,
      "W-d6+": 2036,
      "B-Qxg5+": 2037,
      "W-f6+": 2038,
      "W-Re4+": 2039,
      "W-Qxc1": 2040,
      "W-Kc8": 2041,
      "B-exd6": 2042,
      "W-Nxh6": 2043,
      "B-Rdg8": 2044,
      "W-Bh6+": 2045,
      "B-Ke1": 2046,
      "W-Nf4+": 2047,
      "B-Qxb2+": 2048,
      "B-Rxe3+": 2049,
      "W-Nb6+": 2050,
      "B-Nxc7": 2051,
      "W-Rxh7+": 2052,
      "W-exf6+": 2053,
      "W-Raxd1": 2054,
      "B-Qxh5": 2055,
      "W-Qxb7+": 2056,
      "W-Ndb5": 2057,
      "B-Qa3+": 2058,
      "W-Rh8#": 2059,
      "W-Qh7#": 2060,
      "W-Qh8#": 2061,
      "W-Rf3+": 2062,
      "B-Rxd2+": 2063,
      "B-Kxc3": 2064,
      "W-Ka7": 2065,
      "W-Nbxd2": 2066,
      "W-Rg4+": 2067,
      "B-Nxf7": 2068,
      "W-exf7+": 2069,
      "W-f5+": 2070,
      "B-Bxa5": 2071,
      "W-Nxh6+": 2072,
      "W-Kxh6": 2073,
      "W-Rd8#": 2074,
      "W-Rce1": 2075,
      "B-Kxa4": 2076,
      "B-Kxa3": 2077,
      "B-Qxh3+": 2078,
      "B-Qb3+": 2079,
      "B-Qh1#": 2080,
      "W-Na": 2081,
      "W-Nxh3": 2082,
      "B-Bxc8": 2083,
      "W-Qc8": 2084,
      "W-Rxg6+": 2085,
      "W-Bc5+": 2086,
      "W-Kxa5": 2087,
      "W-Nd8": 2088,
      "B-Bc1": 2089,
      "B-Be5+": 2090,
      "B-Re5+": 2091,
      "W-Kxb5": 2092,
      "B-Bxg7": 2093,
      "W-Kxb2": 2094,
      "B-Rxb2+": 2095,
      "W-Bh7+": 2096,
      "W-Rd4+": 2097,
      "B-Rxf3+": 2098,
      "W-Qa8": 2099,
      "W-Kxb4": 2100,
      "W-Bd3+": 2101,
      "B-Rb8+": 2102,
      "B-Qxa6": 2103,
      "W-Bd6+": 2104,
      "B-Be4+": 2105,
      "B-Bd3+": 2106,
      "W-Rxh2": 2107,
      "W-Rxf6+": 2108,
      "B-Rg6+": 2109,
      "B-Qxf1": 2110,
      "W-Kxc5": 2111,
      "W-e8=Q": 2112,
      "B-Rxg6": 2113,
      "W-Nc4+": 2114,
      "B-Rc4+": 2115,
      "W-Ra5+": 2116,
      "W-Rb5+": 2117,
      "W-Nh": 2118,
      "B-Bxc7": 2119,
      "W-Bxb3": 2120,
      "W-Bxh4": 2121,
      "B-Bxh5": 2122,
      "B-Rec8": 2123,
      "B-Kxa2": 2124,
      "W-Rxc6+": 2125,
      "B-Qxb4+": 2126,
      "B-N7": 2127,
      "W-Bxc1": 2128,
      "B-Rxh2+": 2129,
      "B-Bd6+": 2130,
      "W-fxg7": 2131,
      "W-Qxb8": 2132,
      "W-Qxb8+": 2133,
      "B-Qxb1+": 2134,
      "B-Bxb7": 2135,
      "B-Nxh3+": 2136,
      "##=R": 2137,
      "W-Bxc2": 2138,
      "B-Qxh4+": 2139,
      "B-Ne5+": 2140,
      "B-Bxa8": 2141,
      "W-Nxg7+": 2142,
      "W-Qa6+": 2143,
      "B-Na3": 2144,
      "B-Qh6+": 2145,
      "W-Kb8": 2146,
      "B-Raxd8": 2147,
      "B-Nd5+": 2148,
      "W-Nb5+": 2149,
      "W-Ba3+": 2150,
      "W-Rdc1": 2151,
      "W-Rxb7+": 2152,
      "W-Rxd6+": 2153,
      "B-Nxg3+": 2154,
      "B-f3+": 2155,
      "W-N2": 2156,
      "W-Bc8": 2157,
      "W-Qb6+": 2158,
      "B-Kxg3": 2159,
      "B-e1=Q": 2160,
      "B-Qxh6": 2161,
      "W-Bxa3": 2162,
      "B-Rxd3+": 2163,
      "B-Rg5+": 2164,
      "W-Nxe1": 2165,
      "W-Bb8": 2166,
      "W-Bxh3": 2167,
      "B-f4+": 2168,
      "W-Rbe1": 2169,
      "B-Rd5+": 2170,
      "B-g3+": 2171,
      "B-Bc3+": 2172,
      "B-Qg1": 2173,
      "B-Kxf3": 2174,
      "B-Rag8": 2175,
      "W-Kh8": 2176,
      "W-h4+": 2177,
      "B-Qxg1+": 2178,
      "B-Bxg3+": 2179,
      "W-Rb1+": 2180,
      "W-Bxa1": 2181,
      "B-Nf5+": 2182,
      "W-Nxc6+": 2183,
      "B-Ngxe5": 2184,
      "B-Nxg2+": 2185,
      "B-Bg5+": 2186,
      "W-Qxg4+": 2187,
      "B-Rb4+": 2188,
      "W-Na6": 2189,
      "W-Be8": 2190,
      "B-Bd1": 2191,
      "B-Bh8": 2192,
      "B-Kxc8": 2193,
      "W-Bxg6+": 2194,
      "B-Nxe4+": 2195,
      "B-Bxb6": 2196,
      "B-g4+": 2197,
      "B-Nxe3+": 2198,
      "B-Rh1#": 2199,
      "W-dxc7": 2200,
      "W-Qxa3": 2201,
      "W-Kxg1": 2202,
      "W-Rec1": 2203,
      "W-Qe8#": 2204,
      "##h2+": 2205,
      "W-Qg8": 2206,
      "B-Qxc1": 2207,
      "W-Kxf6": 2208,
      "W-cxb7": 2209,
      "W-Qxg8": 2210,
      "B-d3+": 2211,
      "B-Bc4+": 2212,
      "W-Bf5+": 2213,
      "W-Qa7+": 2214,
      "W-Re8#": 2215,
      "B-Qh2#": 2216,
      "B-Bg8": 2217,
      "W-Re3+": 2218,
      "B-Qb1": 2219,
      "B-Kf1": 2220,
      "W-Kxd5": 2221,
      "W-exf3": 2222,
      "W-Qxg2": 2223,
      "B-Bxg1": 2224,
      "B-Qxa2+": 2225,
      "B-Qh8": 2226,
      "W-Bg4+": 2227,
      "W-Nxg6+": 2228,
      "B-Kxa5": 2229,
      "W-Qf8#": 2230,
      "B-Rh4+": 2231,
      "B-Re1#": 2232,
      "W-Qa5+": 2233,
      "B-Bf3+": 2234,
      "W-R8": 2235,
      "W-R7": 2236,
      "B-Qxg1": 2237,
      "W-Rxh6+": 2238,
      "B-Nbd5": 2239,
      "W-Qxa7+": 2240,
      "B-c4+": 2241,
      "W-Bb4+": 2242,
      "B-Ra5+": 2243,
      "W-Rxf5+": 2244,
      "B-Bh2+": 2245,
      "B-Nbxd7": 2246,
      "B-Qa2+": 2247,
      "W-Bxf1": 2248,
      "B-Bg3+": 2249,
      "B-Kxh8": 2250,
      "W-Kxe6": 2251,
      "B-Rxb1+": 2252,
      "B-Rce8": 2253,
      "B-c1=Q+": 2254,
      "W-Nxg3": 2255,
      "W-Nh5+": 2256,
      "W-Bf8": 2257,
      "B-Bf1": 2258,
      "B-Bf2+": 2259,
      "B-Bh3+": 2260,
      "W-e5+": 2261,
      "W-Qc2+": 2262,
      "W-O-O-O+": 2263,
      "W-e6+": 2264,
      "W-Bxf5+": 2265,
      "W-Ra8#": 2266,
      "W-Neg5": 2267,
      "B-Rd1#": 2268,
      "W-Bxf2": 2269,
      "B-Bh6+": 2270,
      "W-Kxh7": 2271,
      "W-Kxc1": 2272,
      "W-d8=Q+": 2273,
      "B-a1=Q+": 2274,
      "W-c4+": 2275,
      "B-d4+": 2276,
      "W-Rfe1+": 2277,
      "W-Nxa7+": 2278,
      "W-Nge4": 2279,
      "B-e3+": 2280,
      "W-Rxe4+": 2281,
      "B-Nec6": 2282,
      "B-Qa4+": 2283,
      "B-Bxf7": 2284,
      "B-Bxe8": 2285,
      "B-Kxb3": 2286,
      "W-e8=Q+": 2287,
      "B-d1=Q+": 2288,
      "B-Qxb8": 2289,
      "W-c5+": 2290,
      "B-Ba6+": 2291,
      "B-Bd5+": 2292,
      "B-Bb5+": 2293,
      "B-Nxf4+": 2294,
      "B-Kxa7": 2295,
      "B-Qe1#": 2296,
      "W-Qb8": 2297,
      "W-Kxc6": 2298,
      "B-Rxg1": 2299,
      "B-e4+": 2300,
      "B-Kxb2": 2301,
      "W-Ree7": 2302,
      "B-hxg4+": 2303,
      "B-Rc5+": 2304,
      "B-Nb3+": 2305,
      "W-c8=Q+": 2306,
      "W-N1": 2307,
      "B-Nh3": 2308,
      "B-Nxe8": 2309,
      "B-Be1": 2310,
      "W-Rc3+": 2311,
      "W-Kxb3": 2312,
      "W-dxe7": 2313,
      "W-Rag1": 2314,
      "B-Kh1": 2315,
      "W-Rxg8+": 2316,
      "W-Bxg7+": 2317,
      "W-d5+": 2318,
      "B-h1=Q+": 2319,
      "B-Rdc8": 2320,
      "B-Ra6+": 2321,
      "W-Kxa6": 2322,
      "B-Rxh3+": 2323,
      "W-f8=Q+": 2324,
      "B-Nh4+": 2325,
      "W-Bf6+": 2326,
      "W-Rd3+": 2327,
      "W-Rh4+": 2328,
      "B-h5+": 2329,
      "W-Rxg8": 2330,
      "B-Qc7+": 2331,
      "B-Bxg2+": 2332,
      "B-h4+": 2333,
      "W-Nxb8": 2334,
      "B-Nge5": 2335,
